Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/R03.tmx
Source language: en_us
Languages: zh_cn

source: Foster
zh_cn: 寄养

source: Early on a Sunday, after first Mass in Clonegal, my father, instead of taking me home, drives deep into Wexford toward the coast, where my mother's people came from.
zh_cn: 星期天清晨，在科朗格尔进行完第一次弥撒后，爸爸并没有带我回家，而是开车向威克斯福县的海边驶去，那是我妈妈的娘家所在的地方。

source: It is a hot August day, bright, with patches of shade and greenish sudden light along the road.
zh_cn: 那是八月里酷热的一天，天气晴朗，阳光透过枝叶的缝隙，将带着淡绿色的光影洒在路边的树阴里。

source: We pass through the village of Shillelagh, where my father lost our red shorthorn in a game of forty-five, and on past the mart in Carnew, where the man who won her sold her not long afterward.
zh_cn: 我们开着车经过了希莱拉村，我爸爸在那里玩扑克的时候输掉了家里的红奶牛。接着我们又经过了喀纽县城的市场，那个赢了我们奶牛的人在那里很快地又将她卖掉了。

source: My father throws his hat on the passenger seat, winds down the window, and smokes.
zh_cn: 我爸爸把他的帽子扔在副驾驶座上，摇下窗子，开始抽烟。

source: I shake the plaits out of my hair and lie flat on the back seat, looking up through the rear window.
zh_cn: 我把我的辫子散开，然后平躺在后座上，透过后车窗往上看。

source: I wonder what it will be like, this place belonging to the Kinsellas. I see a tall woman standing over me, making me drink milk still hot from the cow.
zh_cn: 我想：那个属于金索拉家的地方到底会是个什么样呢？我仿佛看见了一个高高的女人，她监视着我，让我喝下刚挤出来的，尚还温热的牛奶。

source: I see another, less likely version of her, in an apron, pouring pancake batter into a frying pan, asking would I like another, the way my mother sometimes does when she is in good humor.
zh_cn: 接着我又看见了另一个版本的她，系着围裙，将煎饼糊倒进煎锅里，问我还想不想再要一块 —— 当我妈妈心情好的时候，她有时会这样做。

source: The man will be her size. He will take me to town on the tractor and buy me red lemonade and crisps.
zh_cn: 她家的男人和她体型相仿，这个人会开着拖拉机带我到镇上去，给我买红柠檬汁（爱尔兰一种常见饮料 —— 译者注）和炸薯片。

source: Or he'll make me clean out sheds and pick stones and pull ragweed and docks out of the fields.
zh_cn: 或者他会让我清扫牛棚，拣石子，然后下田除草。

source: I wonder if they live in an old farmhouse or a new bungalow, whether they will have an outhouse or an indoor bathroom, with a toilet and running water.
zh_cn: 我想：他们住的是旧农舍还是新式平房呢？他们用是屋外厕所，还是带着抽水马桶和自来水管道的室内卫生间？

source: An age, it seems, passes before the car slows and turns in to a tarred, narrow lane, then slams over the metal bars of a cattle grid.
zh_cn: 仿佛过了一个世纪，车才开始减速，拐进一条窄窄的柏油路上，然后咣咣地压过一个铺在公路上的拦牛铁栅栏。

source: On either side, thick hedges are trimmed square.
zh_cn: 路的两侧种着两排修得整整齐齐的浓密灌木丛。

source: At the end of the lane, there's a white house with trees whose limbs are trailing the ground.
zh_cn: 而路的尽头是一个白房子，我看到那里树的枝条都垂到了地上。

source: "Da," I say. "The trees."
zh_cn: “爸”，我说，“看那些树”。

source: "What about them?"
zh_cn: “那些树怎么了？”

source: "They're sick," I say.
zh_cn: “它们病了”

source: "They're weeping willows," he says, and clears his throat.
zh_cn: “它们是垂柳”，我爸爸答道，接着清了清嗓子。

source: On the housefront, tall, shiny windowpanes reflect our coming.
zh_cn: 那栋白房子正面是一扇高高的、擦得锃亮的玻璃窗，窗子里透出了我们的车影。

source: I see myself looking out from the back seat, as wild as a tinker's child, with my hair all undone, but my father, at the wheel, looks just like my father.
zh_cn: 我看见自己正从后座往外看，头发乱七八糟，活像一个流浪者的野孩子。然而站在车旁的爸爸看起来却还是我爸爸。

source: A big, loose hound lets out a few rough, halfhearted barks, then sits on the step and looks back at the doorway, where the man has come out to stand.
zh_cn: 屋外，一条没有拴起来的大猎犬粗鲁而冷漠地吠了几声，然后蹲坐在台阶上看着房门口：一个男人已经从里面走了出来，他的身体魁梧结实，就像我的姐妹笔下常常画的那些男人那样。

source: He has a square body like the men my sisters sometimes draw, but his eyebrows are white, to match his hair.
zh_cn: 但是他的眉毛是白色的，和他的白发正好相称。

source: He looks nothing like my mother's people, who are all tall, with long arms, and I wonder if we have not come to the wrong house.
zh_cn: 他看起来不像我母亲家的人，因为我母亲家的人都很高，胳膊很长，我开始怀疑我们是不是走错房子了。

source: "Dan," he says, and tightens himself. "What way are you?"
zh_cn: “嗨，丹”，这个男人叫道，“你最近怎么样？”

source: "John," Da says.
zh_cn: “还不错，约翰”，我爸回应道。

source: They stand looking out over the yard for a moment and then they are talking rain: how little rain there is, how the priest in Kilmuckridge prayed for rain this very morning, how a summer like this was never before known.
zh_cn: 他们站着看了会儿外面的院子，接着开始谈论雨水：他们从最近的雨水多么少，说到科尔-马可瑞志村的牧师今天早上如何求雨，接着又评论说他们以前从未见过这样的夏天。

source: There is a pause, during which my father spits, and then the conversation turns to the price of cattle, the E.E.C., butter mountains, the cost of lime and sheep-dip.
zh_cn: 这时他们停了一下，我爸爸趁此机会吐了口吐沫，接着将话题转向了牛的价格，欧洲经济共同体，黄油山（欧盟大量购买没有卖出的黄油以作为农业补助——译者注）以及柠檬和羊用杀虫剂的花费问题上。

source: I am used to it, this way men have of not talking: they like to kick a divot out of the grass with a boot heel, to slap the roof of a car before it takes off, to sit with their legs wide apart, as though they do not care.
zh_cn: 他们不说话的时候喜欢用靴子跟把草皮从地里踢出来，或者满不在乎地叉开腿坐着，我对此已经习惯了。

source: When the woman comes out, she pays no heed to the men.
zh_cn: 一个女人走了出来，她并没有理睬那两个男人。

source: She is even taller than my mother, with the same black hair, but hers is cut tight like a helmet.
zh_cn: 这个女人比妈妈还高，同样长着一头黑发，但是她的头发剪得很密，就像戴了个头盔一样。

source: She's wearing a printed blouse and brown, flared trousers.
zh_cn: 她身上穿着一件印花罩衫和一条棕色的喇叭裤。

source: The car door is opened and I am taken out, and kissed.
zh_cn: 这个女人打开车门，把我抱出来，亲了亲我的脸颊。

source: "The last time I saw you, you were in the pram," she says, and stands back, expecting an answer.
zh_cn: “我上一次见你的时候，你还在婴儿车里呢”，她说着，向后退了退，等着我的回答。

source: "The pram's broken."
zh_cn: “那个婴儿车坏了。”

source: "What happened at all?"
zh_cn: “它怎么坏了？”

source: "My brother used it for a wheelbarrow and the wheel fell off."
zh_cn: “我弟弟拿它当手推车，然后把轮子弄掉了。”

source: She laughs and licks her thumb and wipes something off my face.
zh_cn: 那个女人笑了，舔了舔手指，把什么东西从我的脸上抹掉了。

source: I can feel her thumb, softer than my mother's, wiping whatever it is away.
zh_cn: 她的手指比我妈妈的更柔软。我能够感受到她的手滑过了我的脸，擦掉了一些东西 —— 不管那是什么吧。

source: When she looks at my clothes, I see my thin cotton dress, my dusty sandals through her eyes.
zh_cn: 接着她低头看我的衣服，透过她的眼睛，我看见自己正穿着薄薄的棉质连衣裙，脚上一双凉鞋沾满了灰尘。

source: Neither one of us knows what to say. A queer, ripe breeze is crossing the yard.
zh_cn: 一时间，我们俩都不知道说什么了，我感到一股奇怪的风刮过了院子。

source: "Come on in, a leanbh."
zh_cn: “进来吧，孩子。”

source: She leads me into the house.
zh_cn: 她领我进了屋子。

source: There's a moment of darkness in the hallway; when I hesitate, she hesitates with me.
zh_cn: 刚进到走廊里的时候感觉屋里很黑，于是我停了一下，她也跟着我停了一下。

source: We walk through into the heat of the kitchen, where I am told to sit down, to make myself at home.
zh_cn: 接着我们走到厨房的烤炉边，她让我坐在那儿，让我别客气，就像在自己家一样。

source: Under the smell of baking, there's some disinfectant, some bleach.
zh_cn: 厨房里弥漫着烤炉的香气，其中还夹杂着一点消毒剂和漂白粉的气味。

source: She lifts a rhubarb tart out of the oven and puts it on the bench.
zh_cn: 她从烤箱里端出一盘大黄挞（大黄：一种红绿色带酸味的长叶柄，加糖烹制后可食用 —— 译者注），把它放在长椅上。

source: Pale-yellow roses are as still as the jar of water they are standing in.
zh_cn: 窗台上淡黄色的玫瑰安静得就像浸着它们的那瓶水一样。

source: "So how is your mammy keeping?"
zh_cn: “你妈妈怎么样？”

source: "She won a tenner on the prize bonds."
zh_cn: “她买彩票中了十块钱。”

source: "She did not."
zh_cn: “她没有。”

source: "She did," I say. "We all had jelly and ice cream and she bought a new tube for the bicycle."
zh_cn: “不，她中奖了”，我说，“她给我们都买了果酱和冰激凌，还给自行车换了新内胎。”

source: I feel, again, the steel teeth of the comb against my scalp earlier that morning, the strength of my mother's hands as she wove my plaits tight, her belly at my back, hard with the next baby.
zh_cn: 我仿佛又感觉到妈妈正用钢梳刮着我的头皮，并用力地拉着我的头发编辫子，就像她今天早上那样。妈妈的肚子顶着我的后背，硬硬的，里面怀着我家下一个孩子。

source: I think of the clean pants she packed in the suitcase, the letter, and what she must have written. Words had passed between my mother and my father:
zh_cn: 我想起她装进我行李箱里的干净裤子和那封信，我知道信里一定会说些什么 —— 我听见了我爸爸和妈妈的对话：

source: "How long should they keep her?"
zh_cn: “他们要收留她多久？”

source: "Can't they keep her as long as they like?"
zh_cn: “难道他们不能想收留多久就收留多久吗？”

source: "Is that what I'll say?"
zh_cn: “难道我就这么人家说吗？”

source: "Say what you like.
zh_cn: “你爱说什么就说什么。

source: Isn't it what you always do."
zh_cn: 你不是一向如此吗？”

source: Now the woman fills an enamel jug with milk.
zh_cn: 那个女人开始往一个瓷罐里倒牛奶。

source: "Your mother must be busy."
zh_cn: “你妈妈一定很忙。”

source: "She's waiting for them to come and cut the hay."
zh_cn: “她在等他们来割干草。”

source: "Have ye not the hay cut?" she says. "Aren't ye late?"
zh_cn: “你们还没有割干草吗？”她说，“不是太晚了？”

source: As the men come in from the yard, it grows momentarily dark, then brightens once again when they sit down.
zh_cn: 男人们从院子里进来的时候，屋里一时间黑了下来，等他们一坐下，却又重新亮了起来。

source: "Well, Missus," Da says, pulling out a chair.
zh_cn: “太太，”爸爸说着，抽出一把椅子。

source: "Dan," she says, in a different voice.
zh_cn: “丹，”她答道，用的是另一种语气。

source: "There's a scorcher of a day."
zh_cn: “又是个大热天。”

source: " 'Tis hot, surely."
zh_cn: “对啊，这样炎热的天气。”

source: She turns her back to watch the kettle, waiting.
zh_cn: 她转身看着身后的水壶，等着水烧开。

source: "Wasn't it a great year for the hay all the same. Never saw the like of it," Da says. "The loft is full to capacity. I nearly split my head on the rafters pitching it in."
zh_cn: “不过，这倒是个收干草的好年份，”我爸爸说，“我家阁楼里的干草都快堆到极限了，我往里扔干草的时候还差点在房梁上磕破了头，真是没见过这种景象。”

source: I wonder why my father lies about the hay.
zh_cn: 我不明白爸爸为什么要在干草问题上撒谎。

source: He is given to lying about things that would be nice, if they were true.
zh_cn: 他总是喜欢骗别人说事情很好，好像那是真的一样。

source: Somewhere farther off, someone has started up a chainsaw and it drones on like a big, stinging wasp for a while.
zh_cn: 这时远处响起了一阵电锯的声音，嗡嗡地像一只蜇人的大黄蜂。

source: I wish I was out there, working.
zh_cn: 我希望我不是在屋里，而是在那里工作。

source: I am unused to sitting still and do not know what to do with my hands.
zh_cn: 我不习惯这种干巴巴地坐着、不知道手里该做些什么的感觉。

source: Part of me wants my father to leave me here while another wants him to take me back, to what I know.
zh_cn: 一方面，我希望爸爸把我留在这儿，而另一方面，却又希望他带我回去，回我熟悉的地方去。

source: I am in a spot where I can neither be what I always am nor turn into what I could be.
zh_cn: 我感觉自己好像被置于了一种回不到原来，却又不能转向他方的境地。

source: The kettle rumbles up to the boiling point, its steel lid clapping.
zh_cn: 壶里的水沸腾起来，蒸汽顶得壶盖啪啪直响。

source: Kinsella gets a stack of plates from the cupboard, opens a drawer and takes out knives and forks, teaspoons.
zh_cn: 金索拉从碗柜里取出一叠盘子，打开抽屉取出刀叉和汤匙。

source: He opens a jar of beetroot and puts it on a saucer with a little serving fork, leaves out sandwich spread and salad cream.
zh_cn: 他打开一罐甜菜根，用一个小分菜叉取出放在碟子上，接着摆上了三明治酱和沙拉酱。

source: Already there's a bowl of tomatoes and onions, chopped fine, a fresh loaf, ham, a block of red cheddar.
zh_cn: 这时，桌上已经有一碗切好的西红柿和洋葱，一条新鲜面包，火腿，和一块切达奶酪。

source: "And what way is Mary?" the woman says.
zh_cn: “玛丽怎么样？”女人问。

source: "Mary?
zh_cn: “玛丽？

source: She's coming near her time."
zh_cn: 她快到预产期了。”

source: "I suppose the last babby is getting hardy?"
zh_cn: “我想上一个孩子已经强壮起来了吧。”

source: "Aye," Da says.
zh_cn: “是啊，”爸说。

source: "He's crawling.
zh_cn: “他在那儿爬来爬去的。

source: It's feeding them that's the trouble. There's no appetite like a child's and, believe you me, this one is no different."
zh_cn: 喂养他们可真是个头疼的事，孩子的胃口没人比的了，你相信我，这个也不例外。”

source: "Ah, don't we all eat in spurts, the same as we grow," the woman says, as though this is something he should know.
zh_cn: “嗨，长身体的时候不都得吃东西么，我们以前也是这样啊，”那女人说道，好像这不是他应该知道的事情似的。

source: "She'll ate but you can work her."
zh_cn: “她会吃你们家的东西，但是你们可以让她做工。”

source: Kinsella looks up at his wife. "There'll be no need for any of that," he says. "The child will have no more to do than help Edna around the house."
zh_cn: 金索拉抬头看看他的妻子，“这完全没有必要，”他说，“这个孩子只要帮埃德娜在家里做做家务就好了。”

source: "We'll keep the child gladly," the woman echoes. "She's welcome here."
zh_cn: “我们非常高兴留下这个孩子，”那个女人响应道，“我们欢迎她住在这儿。”

source: When we sit in at the table, Da tastes the ham and reaches for the beetroot.
zh_cn: 我们坐到了桌边，爸爸先尝了尝火腿，然后伸手去够甜菜根。

source: He doesn't use the serving fork but pitches it onto the plate with his own.
zh_cn: 他并没有用分菜叉，而是用自己的叉子把它丢进盘子里。

source: It stains the pink ham, bleeds.
zh_cn: 甜菜根把粉色的火腿染红了，汁液像血一样流了出来。

source: Tea is poured.
zh_cn: 茶倒进了杯子里。

source: There's a patchy silence as we eat, our knives and forks breaking up what's on our plates.
zh_cn: 我们吃饭的时候，屋里有片刻断断续续的宁静，只听得见我们用刀叉切盘子里食物的声音。

source: After some little scraps of speech, the tart is cut. Cream falls over the hot pastry, into warm pools.
zh_cn: 接着，几句闲谈后，大黄挞被切开了，奶油倒在热呼呼的甜点上，融进果酱的池子里。

source: Now that my father has delivered me and eaten his fill, he is anxious to light his fag and get away.
zh_cn: 这时，我爸已经完成了送我的任务，也吃饱喝足了，于是他开始迫不及待地想要抽烟走人了。

source: Always, it's the same: he never stays in any place long after he's eaten, not like my mother, who would talk until it grew dark and light again. This, at least, is what my father says. I have never known it to happen.
zh_cn: 他总是这样：从不在饭后多待片刻，不像我妈，总是要从天亮聊到天黑，再从天黑聊到天亮 —— 至少我爸爸是这样说的，虽然我从未见过这样的事发生。

source: With my mother it is all work: us, the butter-making, the dinners, the washing up and getting up and getting ready for Mass and school, weaning calves, and hiring men to plow and harrow the fields, stretching the money and setting the alarm for a time before the sun rises.
zh_cn: 和我妈妈在一起的时候总是要工作，我们要做黄油，做晚饭，洗碗，起床，准备弥撒，准备上学，帮小牛断奶，雇人锄地，犁地，省钱，然后把闹表上在太阳升起之前。

source: But this is a different type of house. Here there is room to think. There may even be money to spare.
zh_cn: 但是这是一个不同的房子，这里有时间思考，这里甚至可能有闲钱可花。

source: "I'd better hit the road," Da says.
zh_cn: “我最好上路了。”我爸说。

source: "What hurry is on you?" Kinsella says.
zh_cn: “你急什么？”金索拉说。

source: "The daylight is burning, and I've yet the spuds to spray."
zh_cn: “白天快过去了，我还没给土豆喷药呢。”

source: "There's no fear of blight these evenings," the woman says, but she gets up anyway, and goes out the back door with a sharp knife.
zh_cn: “这些天晚上不用担心枯萎病，”那个女人说道，但她还是站了起来，拿起一把锋利的刀出了后门。

source: A silence climbs between the men while she is gone.
zh_cn: 她一出去，屋里便安静下来。

source: "Give this to Mary," she says, coming in. "I'm snowed under with rhubarb, whatever kind of year it is."
zh_cn: “把这给玛丽，”女人又走了进来，说道：“不管这是怎样的一年，总之我快被家里种的大黄压倒了。”

source: My father takes the rhubarb from her, but it is as awkward as the baby in his arms.
zh_cn: 我爸爸从她手里接过大黄枝，他抱大黄枝的样子就像他抱孩子一样奇怪。

source: A stalk falls to the floor and then another.
zh_cn: 一根茎叶从上面掉了下来，接着又一根掉了下来。

source: He waits for her to pick them up, to hand them to him. She waits for him to do it himself.
zh_cn: 他等着她去捡，而她等着他自己捡。

source: In the end, it's Kinsella who stoops.
zh_cn: 最后，是金索拉屈服了。

source: "There now," he says.
zh_cn: “这就行了，”他说。

source: Out in the yard, my father throws the rhubarb onto the back seat, gets in behind the wheel, and starts the engine.
zh_cn: 到了屋外，我爸爸把大黄扔到车后座上，然后上了车，开始发动引擎。

source: "Good luck to ye," he says. "I hope this girl will give no trouble."
zh_cn: “祝你们好运，”他说，“希望这个女孩不会给你们惹麻烦。”

source: He turns to me. "Try not to fall into the fire, you."
zh_cn: 他又转向我，“你，尽量小心别掉在火里。”

source: I watch him reverse, turn in to the lane, and drive away.
zh_cn: 我看着他调转车头，拐进小道，然后渐渐消失了。

source: Why did he leave without so much as a goodbye or ever mentioning when he would come back for me?
zh_cn: 为什么他走得时候连一句再见也不说，甚至都不提他会回来接我呢？

source: "What's ailing you, child?" the woman says.
zh_cn: “你烦恼些什么呢，孩子？”那女人忽然问道。

source: I look at my feet, dirty in my sandals.
zh_cn: 我低头看着双脚，我的凉鞋上沾满了灰。

source: Kinsella stands in close. "Whatever it is, tell us. We won't mind."
zh_cn: 金索拉站得很近，“不管是什么，告诉我们，我们不会介意的。”

source: "Lord God Almighty, didn't he go and forget all about your wee bits and bobs!" the woman says.
zh_cn: “上帝啊，他就这么走了，把你这小东西完全忘到脑后去了！”那女人说道。

source: "No wonder you're in a state. Well, hasn't he a head like a sieve, the same man."
zh_cn: “怪不得你看起来这么糟糕呢，那个男人的头发不也跟筛子似的。”

source: "Not a word about it," Kinsella says. "We'll have you togged out in no time."
zh_cn: “不说这个了，”金索拉说，“我们马上就打扮你。”

source: When I follow the woman back inside, I want her to say something, to put me at ease.
zh_cn: 我跟着女人往里走，我希望听到她说些什么来安慰我。

source: Instead, she clears the table, picks up the sharp knife, and stands at the window, washing the blade under the running tap.
zh_cn: 然而她没有，她清理了桌子，把刚才割大黄的刀拿起来，站到窗边，在流水下洗干净刀刃。

source: She stares at me as she wipes it clean and puts it away.
zh_cn: 她看着我，把刀擦干，然后收了起来。

source: "Now, girleen," she says. "I think it's nearly time you had a bath."
zh_cn: “好了，小姑娘，”她说，“我想是时候该给你洗个澡了。”

source: She takes me upstairs to a bathroom, plugs the drain, and turns the taps on full.
zh_cn: 她把我带到楼上的一个浴室里，塞上下水道，然后把水龙头开到最大。

source: "Hands up," she says, and pulls my dress off.
zh_cn: “举起手来，”她说着，把我的裙子脱了下来。
